app/controllers/entries_controller.rb

  def create
    @entry = Entry.new(entry_params)

    respond_to do |format|
      if @entry.save
---
INSERT INTO "entries" ("meal_type", "calories", "proteins", "carbohydrates", "fats", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["meal_type", "breakfast"], ["calories", 200], ["proteins", 100], ["carbohydrates", 130], ["fats", 30], ["created_at", "2021-02-09 11:40:11.344114"], ["updated_at", "2021-02-09 11:40:11.344114"]]